<?php
// for문 : 특정 처리를 반복적으로 구현하고자 할 때 사용

// 0 - 5까지 숫자를 출력
// echo "숫자 : 0"."\n";
// echo "1"."\n";
// echo "2"."\n";
// echo "3"."\n";
// echo "4"."\n";
// echo "5"."\n";
// for($i = 1; $i < 6; $i++) {
//     // 우리가 반복하고 싶은 처리
//     echo "숫자 : ".$i."\n";
// }

// break : 처리 중에 break를 만나면 루프 종료
// for($i = 1; $i < 6; $i++) {
//     // 우리가 반복하고 싶은 처리
//     echo "숫자 : ".$i."\n";
//     if($i === 3) {
//         break;
//     }
// }

// continue문 : 처리 중에 continue를 만나면 이후의 처리를 건너뛰고 다음 루프 진행
// for($i = 0; $i < 6; $i++) {
//     if (($i % 2) === 1) {
//         continue;
//     }
//     // 우리가 반복하고 싶은 처리
//     echo "숫자 : ".$i."\n";
// }

// for($i = 0; $i <= 10;$i++) {
//     if(($i%5) === 0) {
//         echo "짝\n";
//         continue;
//     }
//     echo $i."\n";
// }


// // 구구단 2단 출력
// // 2 X 1 = 2
// // 2 X 2 = 4
// // 2 X 3 = 6
// // ...
// // 2 X 9 = 18

// for($i = 1; $i <= 9; $i++) {
//     echo "2 X ".$i." = ".(2*$i)."\n";
// }
// echo "----------------------\n";
// $dan = 3;
// for($i = 1; $i <= 9; $i++) {
//     echo $dan." X ".$i." = ".($dan*$i)."\n";
// }

// echo "----------------------\n";


// // 혼자 장난 -----------------------------------------------
// // 제곱
// for($i = 1; $i <= 19; $i++) {
//     echo $i." X ".$i." = ".($i*$i)."\n";
// }
// // 세제곱
// for($ii = 1; $ii <= 19; $ii++) {
//     echo $ii." ^ 3 = ".($ii*$ii*$ii)."\n";
// }

// // p.100
// $sum = 0;
// $maxValue = 50;
// for($i = 1; $i <= $maxValue; $i++) {
//     if(($i % 2) === 0 ){
//         $sum += $i;
//     }
// }

// echo "1부터 ".$maxValue."까지의 짝수 누적합 : ".$sum."\n";

// $sum2 = 0;
// $maxValue2 = 100;
// for($i = 10; $i <= $maxValue2; $i++) {
//     if(($i % 10) === 0 ){
//         $sum2 += $i;
//     }
// }    

// echo "10부터 ".$maxValue2."까지의 10단위 누적합 : ".$sum2."\n";
// --------------------------------------------------------

$sum = 0;
for($i = 1; $i <= 10; $i++) {
    if(($i%2)===0){
        $sum += $i;
    }
}
echo "1부터 10까지 합은 ".$sum."\n";

// ---------------------
// 다중 루프문
// ---------------------
// for($i = 1; $i < 3; $i++) {
//     echo "바깥 LOOP문 : ".$i."\n";

//     for($z = 1; $z < 3; $z++){
//         echo "안쪽 LOOP문 : z값 = ".$z.", i값 = ".$i."\n";
//     }
// }

// // 구구단 만들기
// for ($i = 2; $i < 10; $i++) {
//     for($z = 1; $z < 10; $z++){
//         echo $i." X ".$z." = ".($i*$z)."\n";
//     } 
//     echo "------------------\n";
// } // 혼자

// 구구단 2 - 9단을 출력
// 예시)
// ** 2단 **
// 2 X 1 = 2
// 2 X 2 = 4
// ...
// 3 X 1 = 3
// 3 X 2 = 6
// ...
// 9 X 8 = 72
// // 9 X 9 = 81

// for($dan = 2; $dan <= 9; $dan++) {
//     echo "\n** ".$dan."단 **\n";
    
//     for($multi = 1; $multi <= 9;$multi++) {
//         echo $dan." X ".$multi." = ".($dan*$multi)."\n";
//     }
// }
// echo "------------------\n";
// // 아래처럼 별을 찍어주세요.
// // 예시)
// // *****
// // *****
// // *****
// // *****
// // *****

// for($s = 1; $s <= 5; $s++) {
//     echo "*****\n";
// }
// echo "------------------\n";

// for($s = 1; $s <= 5; $s++) {
//     for($t = 1; $t <= 5; $t++) {
//         echo "*";
//     }
//     echo "\n";
// }
// echo "------------------\n";

// // 아래처럼 별을 찍어주세요
// // 예시
// // *
// // **
// // ***
// // ****
// // *****
$concat = "";
for($i = 1; $i <= 5; $i++) {
    for($z = 1; $z <= $i; $z++) {
        // echo "*";
        $concat .= "*";
    }

    // echo "\n";
    $concat .= "\n";
}
echo $concat;


// // 아래처럼 별을 찍어주세요
// // 예시
// //     *
// //    **
// //   ***
// //  ****
// // *****

// // space다음 별
// $num = 5;
// for($i = 1; $i <= $num; $i++) {
//     for($z = $num - $i; $z > 0; $z--) {
//         echo " ";
//     }
//     for($k = 1; $k <= $i; $k++){
//         echo "*";
//     }
//     echo "\n";
// }

// // 구구단 6단 - 식 5분
// for($i = 1; $i <= 9; $i++){
//     echo "6 X ".$i." = ".(6*$i)."\n";
// }

